import * as yup from "yup";

export const cashboxFormSchema = yup.object().shape({
  title: yup
    .string()
    .required(`Це поле обов'язкове для заповнення`)
    .min(4, "Мінімальна довжина назви 4 символи")
    .max(32, "Максимальна довжина назви 32 символи")
    .matches(
      /^[^\s].*[^\s]$/,
      "Назва не повинна починатися або закінчуватися пробілами"
    )
    .matches(
      /^(?!.*\s{2,}).*$/,
      "Назва не повинна містити більше одного пробілу між словами"
    ),
  cash: yup
    .number()
    .typeError("Це поле обов'язкове для заповнення")
    .required(`Це поле обов'язкове для заповнення`),
  employeeId: yup.string().required(`Це поле обов'язкове для заповнення`),
});
